import { SightExtendedT } from '@/app/types/sight';

export const mockPloshchadSlavi: SightExtendedT = {
  id: 'glory-square',
  imageUrl: '/images/visits/glory-square.jpg',
  title: 'Памятник В. Н. Татищеву',
  description: 'Памятник Василию Никитичу Татищеву — основателю города Ставрополь-на-Волге, главный исторический символ города.',
  location: 'г. Тольятти',
  address: 'Самарская область, г. Тольятти, микрорайон Портовый, берег Куйбышевского водохранилища Памятник В. Н. Татищеву',
  openingHours: 'Круглосуточно',
  phoneNumber: undefined,
  website: undefined,
  price: 'бесплатно',
  facts: [
    'Одна из главных достопримечательностей города и символ его исторического наследия.',
    'Успешный государственный деятель России XVIII века, историк, географ и основатель городов Ставрополь-на-Волге (ныне Тольятти), Перми и Екатеринбурга.'
  ],
  historyParagraphs: [
    'Памятник Василию Никитичу Татищеву — основателю города Ставрополь-на-Волге (ныне Тольятти) — это главный исторический символ города.',
    'Памятник заказан в 1996 году к празднованию 250-летия основания города (1737 г.) и установлен в сентябре 1998 года.',
    'Примечательно, что изначально поселение назвали Епифания («просвещение» или «просветление» — «момент внезапного прозрения или осознания, когда человеку открывается глубокая истина или понимание сути чего-либо»), подчёркивая причину появления города.',
    'Однако же через два года, в 1739 году, это место получило имя: Ставрополь-на-Волге.',
    'Скульптор передал не только портретное сходство, но и черты характера Татищева — целеустремлённость, мудрость и государственное мышление.',
    'Интересно, что в других городах, основанных Василием Никитичем, установлены памятники в его честь примерно в те же периоды — в Екатеринбурге в августе 1998 года (к 275-летию города: основан в 1723 г.), в Перми — в июне 2003 года (к 280-летию: основан в 1723 г.).',
    'Памятник в Тольятти построен за 2 года (1996–1998) на средства фонда «Духовное наследие», пожертвования организаций и горожан.',
    'Общая стоимость памятника и благоустройства территории составила почти 15 миллионов рублей (~2,5 млн. $ на тот период).',
    'Летом 1996 года многие были удивлены решением скульптора Александра Рукавишникова разместить статую не в центре города, а на берегу Волги на примерно одинаковом расстоянии от 3-х районов города. Но ему удалось отстоять свою точку зрения.',
    'К июлю 1997 года Рукавишников закончил модель в глине. Отливка велась в Польше и Белоруссии, а сложные детали отливали в Чехии.',
    'Затем контрольная сборка и испытания в Минске, после чего в разобранном состоянии был доставлен в Тольятти и установлен на берегу Волги.',
    'Для кладки постамента использовались известняковые плиты из ближайшего карьера Ширяево.',
    'Василий Татищев изображён в полный рост, в историческом костюме XVIII века. Его взгляд направлен в сторону центрального района города, который был построен в период строительства Куйбышевской ГЭС (ныне — Жигулёвская), а по ходу коня находится старая часть города — непосредственно Ставрополь-на-Волге, который был затоплен после запуска ГЭС.',
    'На гранитном постаменте высечена надпись с именем Татищева и годами жизни (1686–1750).',
    'Памятник расположен на живописном берегу Куйбышевского водохранилища в Тольятти, рядом с историческим местом основания города. Это одна из самых популярных обзорных площадок, откуда открывается вид на Волгу и Жигулёвские горы.'
  ],
  videos: [
    { part: 'Часть 1', url: 'https://rutube.ru/video/756a86d75816b1da427886a10a22ae86/?r=plwd' },
  ],
  gallery: [
    { alt: 'Фото 1', url: '/images/visits/ploshchad/1.jpg' },
    { alt: 'Фото 2', url: '/images/visits/ploshchad/2.jpg' },
    { alt: 'Фото 3', url: '/images/visits/ploshchad/3.jpg' },
  ],
  map: {
    center: [53.475641, 49.348957],
    zoom: 12,
    places: [[53.475641, 49.348957]],
  },
};
